Applying **qcon-demo-org**:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # github_repository.spring-petclinic will be created
+   resource "github_repository" "spring-petclinic" {
+       allow_auto_merge            = false
+       allow_merge_commit          = true
+       allow_rebase_merge          = true
+       allow_squash_merge          = true
+       archived                    = false
+       auto_init                   = true
+       branches                    = (known after apply)
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = false
+       description                 = "A sample Spring-based application"
+       etag                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "spring-petclinic"
+       node_id                     = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       visibility                  = "public"
    }

  # github_repository.spring-petclinic-2 will be destroyed
  # (because github_repository.spring-petclinic-2 is not in configuration)
-   resource "github_repository" "spring-petclinic-2" {
-       allow_auto_merge            = false -> null
-       allow_merge_commit          = true -> null
-       allow_rebase_merge          = true -> null
-       allow_squash_merge          = true -> null
-       archived                    = false -> null
-       auto_init                   = true -> null
-       branches                    = [
-           {
-               name      = "main"
-               protected = false
            },
        ] -> null
-       default_branch              = "main" -> null
-       delete_branch_on_merge      = false -> null
-       description                 = "A sample Spring-based application" -> null
-       etag                        = "W/\"e57a2a6d4d17502f8986b6c5741d8d7c39faa5dd3cd63022b49ea749909784de\"" -> null
-       full_name                   = "qcon-demo-org/spring-petclinic-2" -> null
-       git_clone_url               = "git://github.com/qcon-demo-org/spring-petclinic-2.git" -> null
-       has_downloads               = false -> null
-       has_issues                  = false -> null
-       has_projects                = false -> null
-       has_wiki                    = false -> null
-       html_url                    = "https://github.com/qcon-demo-org/spring-petclinic-2" -> null
-       http_clone_url              = "https://github.com/qcon-demo-org/spring-petclinic-2.git" -> null
-       id                          = "spring-petclinic-2" -> null
-       is_template                 = false -> null
-       merge_commit_message        = "PR_TITLE" -> null
-       merge_commit_title          = "MERGE_MESSAGE" -> null
-       name                        = "spring-petclinic-2" -> null
-       node_id                     = "R_kgDOJIuEUA" -> null
-       private                     = false -> null
-       repo_id                     = 613123152 -> null
-       squash_merge_commit_message = "COMMIT_MESSAGES" -> null
-       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
-       ssh_clone_url               = "git@github.com:qcon-demo-org/spring-petclinic-2.git" -> null
-       svn_url                     = "https://github.com/qcon-demo-org/spring-petclinic-2" -> null
-       topics                      = [] -> null
-       visibility                  = "public" -> null
-       vulnerability_alerts        = false -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

```
github_repository.spring-petclinic-2: Destroying... [id=spring-petclinic-2]
github_repository.spring-petclinic: Creating...
github_repository.spring-petclinic-2: Destruction complete after 0s
github_repository.spring-petclinic: Creation complete after 7s [id=spring-petclinic]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.

```